RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/*******************  Bit definition for ADC_CTLR2 register  ********************/
#define  ADC_ADON                       ((uint32_t)0x00000001)        /*!< A/D Converter ON / OFF */
#define  ADC_CONT                       ((uint32_t)0x00000002)        /*!< Continuous Conversion */
#define  ADC_CAL                        ((uint32_t)0x00000004)        /*!< A/D Calibration */
#define  ADC_RSTCAL                     ((uint32_t)0x00000008)        /*!< Reset Calibration */
#define  ADC_DMA                        ((uint32_t)0x00000100)        /*!< Direct Memory access mode */
#define  ADC_ALIGN                      ((uint32_t)0x00000800)        /*!< Data Alignment */

#define  ADC_JEXTSEL                    ((uint32_t)0x00007000)        /*!< JEXTSEL[2:0] bits (External event select for injected group) */
#define  ADC_JEXTSEL_0                  ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_JEXTSEL_1                  ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_JEXTSEL_2                  ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  ADC_JEXTTRIG                   ((uint32_t)0x00008000)        /*!< External Trigger Conversion mode for injected channels */

#define  ADC_EXTSEL                     ((uint32_t)0x000E0000)        /*!< EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_EXTSEL_0                   ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  ADC_EXTSEL_1                   ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  ADC_EXTSEL_2                   ((uint32_t)0x00080000)        /*!< Bit 2 */

#define  ADC_EXTTRIG                    ((uint32_t)0x00100000)        /*!< External Trigger Conversion mode for regular channels */
#define  ADC_JSWSTART                   ((uint32_t)0x00200000)        /*!< Start Conversion of injected channels */
#define  ADC_SWSTART                    ((uint32_t)0x00400000)        /*!< Start Conversion of regular channels */
#define  ADC_TSVREFE                    ((uint32_t)0x00800000)        /*!< Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SAMPTR1 register  *******************/
#define  ADC_SMP10                      ((uint32_t)0x00000007)        /*!< SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMP10_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SMP10_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SMP10_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  ADC_SMP11                      ((uint32_t)0x00000038)        /*!< SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMP11_0                    ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  ADC_SMP11_1                    ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  ADC_SMP11_2                    ((uint32_t)0x00000020)        /*!< Bit 2 */

#define  ADC_SMP12                      ((uint32_t)0x000001C0)        /*!< SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMP12_0                    ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  ADC_SMP12_1                    ((uint32_t)0x00000080)        /*!< Bit 1 */
#define  ADC_SMP12_2                    ((uint32_t)0x00000100)        /*!< Bit 2 */

#define  ADC_SMP13                      ((uint32_t)0x00000E00)        /*!< SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMP13_0                    ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  ADC_SMP13_1                    ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  ADC_SMP13_2                    ((uint32_t)0x00000800)        /*!< Bit 2 */

#define  ADC_SMP14                      ((uint32_t)0x00007000)        /*!< SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMP14_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_SMP14_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_SMP14_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  ADC_SMP15                      ((uint32_t)0x00038000)        /*!< SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMP15_0                    ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_SMP15_1                    ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_SMP15_2                    ((uint32_t)0x00020000)        /*!< Bit 2 */

#define  ADC_SMP16                      ((uint32_t)0x001C0000)        /*!< SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMP16_0                    ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  ADC_SMP16_1                    ((uint32_t)0x00080000)        /*!< Bit 1 */
#define  ADC_SMP16_2                    ((uint32_t)0x00100000)        /*!< Bit 2 */

#define  ADC_SMP17                      ((uint32_t)0x00E00000)        /*!< SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMP17_0                    ((uint32_t)0x00200000)        /*!< Bit 0 */
#define  ADC_SMP17_1                    ((uint32_t)0x00400000)        /*!< Bit 1 */
#define  ADC_SMP17_2                    ((uint32_t)0x00800000)        /*!< Bit 2 */

/******************  Bit definition for ADC_SAMPTR2 register  *******************/
#define  ADC_SMP0                       ((uint32_t)0x00000007)        /*!< SMP0[2:0] bits (Channel 0 Sample time selection) */
#define  ADC_SMP0_0                     ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SMP0_1                     ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SMP0_2                     ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  ADC_SMP1                       ((uint32_t)0x00000038)        /*!< SMP1[2:0] bits (Channel 1 Sample time selection) */
#define  ADC_SMP1_0                     ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  ADC_SMP1_1                     ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  ADC_SMP1_2                     ((uint32_t)0x00000020)        /*!< Bit 2 */

