RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
#define  ADC_SMP2                       ((uint32_t)0x000001C0)        /*!< SMP2[2:0] bits (Channel 2 Sample time selection) */
#define  ADC_SMP2_0                     ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  ADC_SMP2_1                     ((uint32_t)0x00000080)        /*!< Bit 1 */
#define  ADC_SMP2_2                     ((uint32_t)0x00000100)        /*!< Bit 2 */

#define  ADC_SMP3                       ((uint32_t)0x00000E00)        /*!< SMP3[2:0] bits (Channel 3 Sample time selection) */
#define  ADC_SMP3_0                     ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  ADC_SMP3_1                     ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  ADC_SMP3_2                     ((uint32_t)0x00000800)        /*!< Bit 2 */

#define  ADC_SMP4                       ((uint32_t)0x00007000)        /*!< SMP4[2:0] bits (Channel 4 Sample time selection) */
#define  ADC_SMP4_0                     ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_SMP4_1                     ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_SMP4_2                     ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  ADC_SMP5                       ((uint32_t)0x00038000)        /*!< SMP5[2:0] bits (Channel 5 Sample time selection) */
#define  ADC_SMP5_0                     ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_SMP5_1                     ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_SMP5_2                     ((uint32_t)0x00020000)        /*!< Bit 2 */

#define  ADC_SMP6                       ((uint32_t)0x001C0000)        /*!< SMP6[2:0] bits (Channel 6 Sample time selection) */
#define  ADC_SMP6_0                     ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  ADC_SMP6_1                     ((uint32_t)0x00080000)        /*!< Bit 1 */
#define  ADC_SMP6_2                     ((uint32_t)0x00100000)        /*!< Bit 2 */

#define  ADC_SMP7                       ((uint32_t)0x00E00000)        /*!< SMP7[2:0] bits (Channel 7 Sample time selection) */
#define  ADC_SMP7_0                     ((uint32_t)0x00200000)        /*!< Bit 0 */
#define  ADC_SMP7_1                     ((uint32_t)0x00400000)        /*!< Bit 1 */
#define  ADC_SMP7_2                     ((uint32_t)0x00800000)        /*!< Bit 2 */

#define  ADC_SMP8                       ((uint32_t)0x07000000)        /*!< SMP8[2:0] bits (Channel 8 Sample time selection) */
#define  ADC_SMP8_0                     ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  ADC_SMP8_1                     ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  ADC_SMP8_2                     ((uint32_t)0x04000000)        /*!< Bit 2 */

#define  ADC_SMP9                       ((uint32_t)0x38000000)        /*!< SMP9[2:0] bits (Channel 9 Sample time selection) */
#define  ADC_SMP9_0                     ((uint32_t)0x08000000)        /*!< Bit 0 */
#define  ADC_SMP9_1                     ((uint32_t)0x10000000)        /*!< Bit 1 */
#define  ADC_SMP9_2                     ((uint32_t)0x20000000)        /*!< Bit 2 */

/******************  Bit definition for ADC_IOFR1 register  *******************/
#define  ADC_JOFFSET1                   ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 1 */

/******************  Bit definition for ADC_IOFR2 register  *******************/
#define  ADC_JOFFSET2                   ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 2 */

/******************  Bit definition for ADC_IOFR3 register  *******************/
#define  ADC_JOFFSET3                   ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 3 */

/******************  Bit definition for ADC_IOFR4 register  *******************/
#define  ADC_JOFFSET4                   ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 4 */

/*******************  Bit definition for ADC_WDHTR register  ********************/
#define  ADC_HT                         ((uint16_t)0x0FFF)            /*!< Analog watchdog high threshold */

/*******************  Bit definition for ADC_WDLTR register  ********************/
#define  ADC_LT                         ((uint16_t)0x0FFF)            /*!< Analog watchdog low threshold */

/*******************  Bit definition for ADC_RSQR1 register  *******************/
#define  ADC_SQ13                       ((uint32_t)0x0000001F)        /*!< SQ13[4:0] bits (13th conversion in regular sequence) */
#define  ADC_SQ13_0                     ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SQ13_1                     ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SQ13_2                     ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_SQ13_3                     ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_SQ13_4                     ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_SQ14                       ((uint32_t)0x000003E0)        /*!< SQ14[4:0] bits (14th conversion in regular sequence) */
#define  ADC_SQ14_0                     ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  ADC_SQ14_1                     ((uint32_t)0x00000040)        /*!< Bit 1 */
#define  ADC_SQ14_2                     ((uint32_t)0x00000080)        /*!< Bit 2 */
#define  ADC_SQ14_3                     ((uint32_t)0x00000100)        /*!< Bit 3 */
#define  ADC_SQ14_4                     ((uint32_t)0x00000200)        /*!< Bit 4 */

#define  ADC_SQ15                       ((uint32_t)0x00007C00)        /*!< SQ15[4:0] bits (15th conversion in regular sequence) */
#define  ADC_SQ15_0                     ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  ADC_SQ15_1                     ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  ADC_SQ15_2                     ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  ADC_SQ15_3                     ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  ADC_SQ15_4                     ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  ADC_SQ16                       ((uint32_t)0x000F8000)        /*!< SQ16[4:0] bits (16th conversion in regular sequence) */
#define  ADC_SQ16_0                     ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_SQ16_1                     ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_SQ16_2                     ((uint32_t)0x00020000)        /*!< Bit 2 */
#define  ADC_SQ16_3                     ((uint32_t)0x00040000)        /*!< Bit 3 */
#define  ADC_SQ16_4                     ((uint32_t)0x00080000)        /*!< Bit 4 */

#define  ADC_L                          ((uint32_t)0x00F00000)        /*!< L[3:0] bits (Regular channel sequence length) */
#define  ADC_L_0                        ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  ADC_L_1                        ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  ADC_L_2                        ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  ADC_L_3                        ((uint32_t)0x00800000)        /*!< Bit 3 */

/*******************  Bit definition for ADC_RSQR2 register  *******************/
#define  ADC_SQ7                        ((uint32_t)0x0000001F)        /*!< SQ7[4:0] bits (7th conversion in regular sequence) */
#define  ADC_SQ7_0                      ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SQ7_1                      ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SQ7_2                      ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_SQ7_3                      ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_SQ7_4                      ((uint32_t)0x00000010)        /*!< Bit 4 */

