RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/*******************  Bit definition for BKP_DATAR38 register  *******************/
#define  BKP_DATAR38_D                          ((uint16_t)0xFFFF)     /*!< Backup data */

/*******************  Bit definition for BKP_DATAR39 register  *******************/
#define  BKP_DATAR39_D                          ((uint16_t)0xFFFF)     /*!< Backup data */

/*******************  Bit definition for BKP_DATAR40 register  *******************/
#define  BKP_DATAR40_D                          ((uint16_t)0xFFFF)     /*!< Backup data */

/*******************  Bit definition for BKP_DATAR41 register  *******************/
#define  BKP_DATAR41_D                          ((uint16_t)0xFFFF)     /*!< Backup data */

/*******************  Bit definition for BKP_DATAR42 register  *******************/
#define  BKP_DATAR42_D                          ((uint16_t)0xFFFF)     /*!< Backup data */

/******************  Bit definition for BKP_OCTLR register  *******************/
#define  BKP_CAL                                ((uint16_t)0x007F)     /*!< Calibration value */
#define  BKP_CCO                                ((uint16_t)0x0080)     /*!< Calibration Clock Output */
#define  BKP_ASOE                               ((uint16_t)0x0100)     /*!< Alarm or Second Output Enable */
#define  BKP_ASOS                               ((uint16_t)0x0200)     /*!< Alarm or Second Output Selection */

/********************  Bit definition for BKP_TPCTLR register  ********************/
#define  BKP_TPE                                ((uint8_t)0x01)        /*!< TAMPER pin enable */
#define  BKP_TPAL                               ((uint8_t)0x02)        /*!< TAMPER pin active level */

/*******************  Bit definition for BKP_TPCSR register  ********************/
#define  BKP_CTE                                ((uint16_t)0x0001)     /*!< Clear Tamper event */
#define  BKP_CTI                                ((uint16_t)0x0002)     /*!< Clear Tamper Interrupt */
#define  BKP_TPIE                               ((uint16_t)0x0004)     /*!< TAMPER Pin interrupt enable */
#define  BKP_TEF                                ((uint16_t)0x0100)     /*!< Tamper Event Flag */
#define  BKP_TIF                                ((uint16_t)0x0200)     /*!< Tamper Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                         Controller Area Network                            */
/*                                                                            */
/******************************************************************************/

/*!< CAN control and status registers */
/*******************  Bit definition for CAN_CTLR register  ********************/
#define  CAN_CTLR_INRQ                       ((uint16_t)0x0001)            /*!< Initialization Request */
#define  CAN_CTLR_SLEEP                      ((uint16_t)0x0002)            /*!< Sleep Mode Request */
#define  CAN_CTLR_TXFP                       ((uint16_t)0x0004)            /*!< Transmit FIFO Priority */
#define  CAN_CTLR_RFLM                       ((uint16_t)0x0008)            /*!< Receive FIFO Locked Mode */
#define  CAN_CTLR_NART                       ((uint16_t)0x0010)            /*!< No Automatic Retransmission */
#define  CAN_CTLR_AWUM                       ((uint16_t)0x0020)            /*!< Automatic Wakeup Mode */
#define  CAN_CTLR_ABOM                       ((uint16_t)0x0040)            /*!< Automatic Bus-Off Management */
#define  CAN_CTLR_TTCM                       ((uint16_t)0x0080)            /*!< Time Triggered Communication Mode */
#define  CAN_CTLR_RESET                      ((uint16_t)0x8000)            /*!< CAN software master reset */

/*******************  Bit definition for CAN_STATR register  ********************/
#define  CAN_STATR_INAK                      ((uint16_t)0x0001)            /*!< Initialization Acknowledge */
#define  CAN_STATR_SLAK                      ((uint16_t)0x0002)            /*!< Sleep Acknowledge */
#define  CAN_STATR_ERRI                      ((uint16_t)0x0004)            /*!< Error Interrupt */
#define  CAN_STATR_WKUI                      ((uint16_t)0x0008)            /*!< Wakeup Interrupt */
#define  CAN_STATR_SLAKI                     ((uint16_t)0x0010)            /*!< Sleep Acknowledge Interrupt */
#define  CAN_STATR_TXM                       ((uint16_t)0x0100)            /*!< Transmit Mode */
#define  CAN_STATR_RXM                       ((uint16_t)0x0200)            /*!< Receive Mode */
#define  CAN_STATR_SAMP                      ((uint16_t)0x0400)            /*!< Last Sample Point */
#define  CAN_STATR_RX                        ((uint16_t)0x0800)            /*!< CAN Rx Signal */

/*******************  Bit definition for CAN_TSTATR register  ********************/
#define  CAN_TSTATR_RQCP0                    ((uint32_t)0x00000001)        /*!< Request Completed Mailbox0 */
#define  CAN_TSTATR_TXOK0                    ((uint32_t)0x00000002)        /*!< Transmission OK of Mailbox0 */
#define  CAN_TSTATR_ALST0                    ((uint32_t)0x00000004)        /*!< Arbitration Lost for Mailbox0 */
#define  CAN_TSTATR_TERR0                    ((uint32_t)0x00000008)        /*!< Transmission Error of Mailbox0 */
#define  CAN_TSTATR_ABRQ0                    ((uint32_t)0x00000080)        /*!< Abort Request for Mailbox0 */
#define  CAN_TSTATR_RQCP1                    ((uint32_t)0x00000100)        /*!< Request Completed Mailbox1 */
#define  CAN_TSTATR_TXOK1                    ((uint32_t)0x00000200)        /*!< Transmission OK of Mailbox1 */
#define  CAN_TSTATR_ALST1                    ((uint32_t)0x00000400)        /*!< Arbitration Lost for Mailbox1 */
#define  CAN_TSTATR_TERR1                    ((uint32_t)0x00000800)        /*!< Transmission Error of Mailbox1 */
#define  CAN_TSTATR_ABRQ1                    ((uint32_t)0x00008000)        /*!< Abort Request for Mailbox 1 */
#define  CAN_TSTATR_RQCP2                    ((uint32_t)0x00010000)        /*!< Request Completed Mailbox2 */
#define  CAN_TSTATR_TXOK2                    ((uint32_t)0x00020000)        /*!< Transmission OK of Mailbox 2 */
#define  CAN_TSTATR_ALST2                    ((uint32_t)0x00040000)        /*!< Arbitration Lost for mailbox 2 */
#define  CAN_TSTATR_TERR2                    ((uint32_t)0x00080000)        /*!< Transmission Error of Mailbox 2 */
#define  CAN_TSTATR_ABRQ2                    ((uint32_t)0x00800000)        /*!< Abort Request for Mailbox 2 */
#define  CAN_TSTATR_CODE                     ((uint32_t)0x03000000)        /*!< Mailbox Code */

#define  CAN_TSTATR_TME                      ((uint32_t)0x1C000000)        /*!< TME[2:0] bits */
#define  CAN_TSTATR_TME0                     ((uint32_t)0x04000000)        /*!< Transmit Mailbox 0 Empty */
#define  CAN_TSTATR_TME1                     ((uint32_t)0x08000000)        /*!< Transmit Mailbox 1 Empty */
#define  CAN_TSTATR_TME2                     ((uint32_t)0x10000000)        /*!< Transmit Mailbox 2 Empty */

#define  CAN_TSTATR_LOW                      ((uint32_t)0xE0000000)        /*!< LOW[2:0] bits */
#define  CAN_TSTATR_LOW0                     ((uint32_t)0x20000000)        /*!< Lowest Priority Flag for Mailbox 0 */
#define  CAN_TSTATR_LOW1                     ((uint32_t)0x40000000)        /*!< Lowest Priority Flag for Mailbox 1 */
#define  CAN_TSTATR_LOW2                     ((uint32_t)0x80000000)        /*!< Lowest Priority Flag for Mailbox 2 */

/*******************  Bit definition for CAN_RFIFO0 register  *******************/
#define  CAN_RFIFO0_FMP0                     ((uint8_t)0x03)               /*!< FIFO 0 Message Pending */
#define  CAN_RFIFO0_FULL0                    ((uint8_t)0x08)               /*!< FIFO 0 Full */
#define  CAN_RFIFO0_FOVR0                    ((uint8_t)0x10)               /*!< FIFO 0 Overrun */
#define  CAN_RFIFO0_RFOM0                    ((uint8_t)0x20)               /*!< Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RFIFO1 register  *******************/
#define  CAN_RFIFO1_FMP1                     ((uint8_t)0x03)               /*!< FIFO 1 Message Pending */
#define  CAN_RFIFO1_FULL1                    ((uint8_t)0x08)               /*!< FIFO 1 Full */
#define  CAN_RFIFO1_FOVR1                    ((uint8_t)0x10)               /*!< FIFO 1 Overrun */
#define  CAN_RFIFO1_RFOM1                    ((uint8_t)0x20)               /*!< Release FIFO 1 Output Mailbox */

/********************  Bit definition for CAN_INTENR register  *******************/
#define  CAN_INTENR_TMEIE                    ((uint32_t)0x00000001)        /*!< Transmit Mailbox Empty Interrupt Enable */
#define  CAN_INTENR_FMPIE0                   ((uint32_t)0x00000002)        /*!< FIFO Message Pending Interrupt Enable */
#define  CAN_INTENR_FFIE0                    ((uint32_t)0x00000004)        /*!< FIFO Full Interrupt Enable */
#define  CAN_INTENR_FOVIE0                   ((uint32_t)0x00000008)        /*!< FIFO Overrun Interrupt Enable */
#define  CAN_INTENR_FMPIE1                   ((uint32_t)0x00000010)        /*!< FIFO Message Pending Interrupt Enable */
#define  CAN_INTENR_FFIE1                    ((uint32_t)0x00000020)        /*!< FIFO Full Interrupt Enable */
#define  CAN_INTENR_FOVIE1                   ((uint32_t)0x00000040)        /*!< FIFO Overrun Interrupt Enable */
#define  CAN_INTENR_EWGIE                    ((uint32_t)0x00000100)        /*!< Error Warning Interrupt Enable */
#define  CAN_INTENR_EPVIE                    ((uint32_t)0x00000200)        /*!< Error Passive Interrupt Enable */
#define  CAN_INTENR_BOFIE                    ((uint32_t)0x00000400)        /*!< Bus-Off Interrupt Enable */
#define  CAN_INTENR_LECIE                    ((uint32_t)0x00000800)        /*!< Last Error Code Interrupt Enable */
#define  CAN_INTENR_ERRIE                    ((uint32_t)0x00008000)        /*!< Error Interrupt Enable */
#define  CAN_INTENR_WKUIE                    ((uint32_t)0x00010000)        /*!< Wakeup Interrupt Enable */
#define  CAN_INTENR_SLKIE                    ((uint32_t)0x00020000)        /*!< Sleep Interrupt Enable */

/********************  Bit definition for CAN_ERRSR register  *******************/
#define  CAN_ERRSR_EWGF                      ((uint32_t)0x00000001)        /*!< Error Warning Flag */
#define  CAN_ERRSR_EPVF                      ((uint32_t)0x00000002)        /*!< Error Passive Flag */
#define  CAN_ERRSR_BOFF                      ((uint32_t)0x00000004)        /*!< Bus-Off Flag */

#define  CAN_ERRSR_LEC                       ((uint32_t)0x00000070)        /*!< LEC[2:0] bits (Last Error Code) */
#define  CAN_ERRSR_LEC_0                     ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  CAN_ERRSR_LEC_1                     ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  CAN_ERRSR_LEC_2                     ((uint32_t)0x00000040)        /*!< Bit 2 */

