RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
#define  CAN_ERRSR_TEC                       ((uint32_t)0x00FF0000)        /*!< Least significant byte of the 9-bit Transmit Error Counter */
#define  CAN_ERRSR_REC                       ((uint32_t)0xFF000000)        /*!< Receive Error Counter */

/*******************  Bit definition for CAN_BTIMR register  ********************/
#define  CAN_BTIMR_BRP                       ((uint32_t)0x000003FF)        /*!< Baud Rate Prescaler */
#define  CAN_BTIMR_TS1                       ((uint32_t)0x000F0000)        /*!< Time Segment 1 */
#define  CAN_BTIMR_TS2                       ((uint32_t)0x00700000)        /*!< Time Segment 2 */
#define  CAN_BTIMR_SJW                       ((uint32_t)0x03000000)        /*!< Resynchronization Jump Width */
#define  CAN_BTIMR_LBKM                      ((uint32_t)0x40000000)        /*!< Loop Back Mode (Debug) */
#define  CAN_BTIMR_SILM                      ((uint32_t)0x80000000)        /*!< Silent Mode */

/*!< Mailbox registers */
/******************  Bit definition for CAN_TXMI0R register  ********************/
#define  CAN_TXMI0R_TXRQ                     ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TXMI0R_RTR                      ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TXMI0R_IDE                      ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TXMI0R_EXID                     ((uint32_t)0x001FFFF8)        /*!< Extended Identifier */
#define  CAN_TXMI0R_STID                     ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/******************  Bit definition for CAN_TXMDT0R register  *******************/
#define  CAN_TXMDT0R_DLC                     ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TXMDT0R_TGT                     ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TXMDT0R_TIME                    ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/******************  Bit definition for CAN_TXMDL0R register  *******************/
#define  CAN_TXMDL0R_DATA0                   ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TXMDL0R_DATA1                   ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TXMDL0R_DATA2                   ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TXMDL0R_DATA3                   ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/******************  Bit definition for CAN_TXMDH0R register  *******************/
#define  CAN_TXMDH0R_DATA4                   ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TXMDH0R_DATA5                   ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TXMDH0R_DATA6                   ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TXMDH0R_DATA7                   ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/*******************  Bit definition for CAN_TXMI1R register  *******************/
#define  CAN_TXMI1R_TXRQ                     ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TXMI1R_RTR                      ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TXMI1R_IDE                      ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TXMI1R_EXID                     ((uint32_t)0x001FFFF8)        /*!< Extended Identifier */
#define  CAN_TXMI1R_STID                     ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT1R register  ******************/
#define  CAN_TXMDT1R_DLC                     ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TXMDT1R_TGT                     ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TXMDT1R_TIME                    ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL1R register  ******************/
#define  CAN_TXMDL1R_DATA0                   ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TXMDL1R_DATA1                   ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TXMDL1R_DATA2                   ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TXMDL1R_DATA3                   ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_TXMDH1R register  ******************/
#define  CAN_TXMDH1R_DATA4                   ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TXMDH1R_DATA5                   ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TXMDH1R_DATA6                   ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TXMDH1R_DATA7                   ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/*******************  Bit definition for CAN_TXMI2R register  *******************/
#define  CAN_TXMI2R_TXRQ                     ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TXMI2R_RTR                      ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TXMI2R_IDE                      ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TXMI2R_EXID                     ((uint32_t)0x001FFFF8)        /*!< Extended identifier */
#define  CAN_TXMI2R_STID                     ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT2R register  ******************/  
#define  CAN_TXMDT2R_DLC                     ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TXMDT2R_TGT                     ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TXMDT2R_TIME                    ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL2R register  ******************/
#define  CAN_TXMDL2R_DATA0                   ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TXMDL2R_DATA1                   ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TXMDL2R_DATA2                   ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TXMDL2R_DATA3                   ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_TXMDH2R register  ******************/
#define  CAN_TXMDH2R_DATA4                   ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TXMDH2R_DATA5                   ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TXMDH2R_DATA6                   ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TXMDH2R_DATA7                   ((uint32_t)0xFF000000)        /*!< Data byte 7 */

