RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
#define  DAC_TSEL1                        ((uint32_t)0x00000038)        /*!< TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_TSEL1_0                      ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  DAC_TSEL1_1                      ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  DAC_TSEL1_2                      ((uint32_t)0x00000020)        /*!< Bit 2 */

#define  DAC_WAVE1                        ((uint32_t)0x000000C0)        /*!< WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_WAVE1_0                      ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  DAC_WAVE1_1                      ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  DAC_MAMP1                        ((uint32_t)0x00000F00)        /*!< MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define  DAC_MAMP1_0                      ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  DAC_MAMP1_1                      ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  DAC_MAMP1_2                      ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  DAC_MAMP1_3                      ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  DAC_DMAEN1                       ((uint32_t)0x00001000)        /*!< DAC channel1 DMA enable */
#define  DAC_EN2                          ((uint32_t)0x00010000)        /*!< DAC channel2 enable */
#define  DAC_BOFF2                        ((uint32_t)0x00020000)        /*!< DAC channel2 output buffer disable */
#define  DAC_TEN2                         ((uint32_t)0x00040000)        /*!< DAC channel2 Trigger enable */

#define  DAC_TSEL2                        ((uint32_t)0x00380000)        /*!< TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_TSEL2_0                      ((uint32_t)0x00080000)        /*!< Bit 0 */
#define  DAC_TSEL2_1                      ((uint32_t)0x00100000)        /*!< Bit 1 */
#define  DAC_TSEL2_2                      ((uint32_t)0x00200000)        /*!< Bit 2 */

#define  DAC_WAVE2                        ((uint32_t)0x00C00000)        /*!< WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_WAVE2_0                      ((uint32_t)0x00400000)        /*!< Bit 0 */
#define  DAC_WAVE2_1                      ((uint32_t)0x00800000)        /*!< Bit 1 */

#define  DAC_MAMP2                        ((uint32_t)0x0F000000)        /*!< MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_MAMP2_0                      ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  DAC_MAMP2_1                      ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  DAC_MAMP2_2                      ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  DAC_MAMP2_3                      ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  DAC_DMAEN2                       ((uint32_t)0x10000000)        /*!< DAC channel2 DMA enabled */

/*****************  Bit definition for DAC_SWTR register  ******************/
#define  DAC_SWTRIG1                      ((uint8_t)0x01)                        /*!< DAC channel1 software trigger */
#define  DAC_SWTRIG2                      ((uint8_t)0x02)                        /*!< DAC channel2 software trigger */

/*****************  Bit definition for DAC_R12BDHR1 register  ******************/
#define  DAC_DHR12R1                      ((uint16_t)0x0FFF)                      /*!< DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_L12BDHR1 register  ******************/
#define  DAC_DHR12L1                      ((uint16_t)0xFFF0)                      /*!< DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_R8BDHR1 register  ******************/
#define  DAC_DHR8R1                       ((uint8_t)0xFF)                         /*!< DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_R12BDHR2 register  ******************/
#define  DAC_DHR12R2                      ((uint16_t)0x0FFF)                      /*!< DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_L12BDHR2 register  ******************/
#define  DAC_DHR12L2                      ((uint16_t)0xFFF0)                      /*!< DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_R8BDHR2 register  ******************/
#define  DAC_DHR8R2                       ((uint8_t)0xFF)                         /*!< DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_RD12BDHR register  ******************/
#define  DAC_RD12BDHR_DACC1DHR            ((uint32_t)0x00000FFF)        /*!< DAC channel1 12-bit Right aligned data */
#define  DAC_RD12BDHR_DACC2DHR            ((uint32_t)0x0FFF0000)        /*!< DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_LD12BDHR register  ******************/
#define  DAC_LD12BDHR_DACC1DHR            ((uint32_t)0x0000FFF0)        /*!< DAC channel1 12-bit Left aligned data */
#define  DAC_LD12BDHR_DACC2DHR            ((uint32_t)0xFFF00000)        /*!< DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_RD8BDHR register  ******************/
#define  DAC_RD8BDHR_DACC1DHR             ((uint16_t)0x00FF)            /*!< DAC channel1 8-bit Right aligned data */
#define  DAC_RD8BDHR_DACC2DHR             ((uint16_t)0xFF00)            /*!< DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_DOR1 register  *******************/
#define  DAC_DACC1DOR                     ((uint16_t)0x0FFF)            /*!< DAC channel1 data output */

/*******************  Bit definition for DAC_DOR2 register  *******************/
#define  DAC_DACC2DOR                     ((uint16_t)0x0FFF)            /*!< DAC channel2 data output */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for DMA_INTFR register  ********************/
#define  DMA_GIF1                           ((uint32_t)0x00000001)        /*!< Channel 1 Global interrupt flag */
#define  DMA_TCIF1                          ((uint32_t)0x00000002)        /*!< Channel 1 Transfer Complete flag */
#define  DMA_HTIF1                          ((uint32_t)0x00000004)        /*!< Channel 1 Half Transfer flag */
#define  DMA_TEIF1                          ((uint32_t)0x00000008)        /*!< Channel 1 Transfer Error flag */
#define  DMA_GIF2                           ((uint32_t)0x00000010)        /*!< Channel 2 Global interrupt flag */
#define  DMA_TCIF2                          ((uint32_t)0x00000020)        /*!< Channel 2 Transfer Complete flag */
#define  DMA_HTIF2                          ((uint32_t)0x00000040)        /*!< Channel 2 Half Transfer flag */
#define  DMA_TEIF2                          ((uint32_t)0x00000080)        /*!< Channel 2 Transfer Error flag */
#define  DMA_GIF3                           ((uint32_t)0x00000100)        /*!< Channel 3 Global interrupt flag */
#define  DMA_TCIF3                          ((uint32_t)0x00000200)        /*!< Channel 3 Transfer Complete flag */
#define  DMA_HTIF3                          ((uint32_t)0x00000400)        /*!< Channel 3 Half Transfer flag */
#define  DMA_TEIF3                          ((uint32_t)0x00000800)        /*!< Channel 3 Transfer Error flag */
#define  DMA_GIF4                           ((uint32_t)0x00001000)        /*!< Channel 4 Global interrupt flag */
#define  DMA_TCIF4                          ((uint32_t)0x00002000)        /*!< Channel 4 Transfer Complete flag */
#define  DMA_HTIF4                          ((uint32_t)0x00004000)        /*!< Channel 4 Half Transfer flag */
#define  DMA_TEIF4                          ((uint32_t)0x00008000)        /*!< Channel 4 Transfer Error flag */
#define  DMA_GIF5                           ((uint32_t)0x00010000)        /*!< Channel 5 Global interrupt flag */
#define  DMA_TCIF5                          ((uint32_t)0x00020000)        /*!< Channel 5 Transfer Complete flag */
#define  DMA_HTIF5                          ((uint32_t)0x00040000)        /*!< Channel 5 Half Transfer flag */
#define  DMA_TEIF5                          ((uint32_t)0x00080000)        /*!< Channel 5 Transfer Error flag */
#define  DMA_GIF6                           ((uint32_t)0x00100000)        /*!< Channel 6 Global interrupt flag */
#define  DMA_TCIF6                          ((uint32_t)0x00200000)        /*!< Channel 6 Transfer Complete flag */
#define  DMA_HTIF6                          ((uint32_t)0x00400000)        /*!< Channel 6 Half Transfer flag */
#define  DMA_TEIF6                          ((uint32_t)0x00800000)        /*!< Channel 6 Transfer Error flag */
#define  DMA_GIF7                           ((uint32_t)0x01000000)        /*!< Channel 7 Global interrupt flag */
#define  DMA_TCIF7                          ((uint32_t)0x02000000)        /*!< Channel 7 Transfer Complete flag */
#define  DMA_HTIF7                          ((uint32_t)0x04000000)        /*!< Channel 7 Half Transfer flag */
#define  DMA_TEIF7                          ((uint32_t)0x08000000)        /*!< Channel 7 Transfer Error flag */

/*******************  Bit definition for DMA_INTFCR register  *******************/
#define  DMA_CGIF1                          ((uint32_t)0x00000001)        /*!< Channel 1 Global interrupt clear */
#define  DMA_CTCIF1                         ((uint32_t)0x00000002)        /*!< Channel 1 Transfer Complete clear */
#define  DMA_CHTIF1                         ((uint32_t)0x00000004)        /*!< Channel 1 Half Transfer clear */
#define  DMA_CTEIF1                         ((uint32_t)0x00000008)        /*!< Channel 1 Transfer Error clear */
#define  DMA_CGIF2                          ((uint32_t)0x00000010)        /*!< Channel 2 Global interrupt clear */
#define  DMA_CTCIF2                         ((uint32_t)0x00000020)        /*!< Channel 2 Transfer Complete clear */
#define  DMA_CHTIF2                         ((uint32_t)0x00000040)        /*!< Channel 2 Half Transfer clear */
#define  DMA_CTEIF2                         ((uint32_t)0x00000080)        /*!< Channel 2 Transfer Error clear */
#define  DMA_CGIF3                          ((uint32_t)0x00000100)        /*!< Channel 3 Global interrupt clear */
#define  DMA_CTCIF3                         ((uint32_t)0x00000200)        /*!< Channel 3 Transfer Complete clear */
#define  DMA_CHTIF3                         ((uint32_t)0x00000400)        /*!< Channel 3 Half Transfer clear */
#define  DMA_CTEIF3                         ((uint32_t)0x00000800)        /*!< Channel 3 Transfer Error clear */
#define  DMA_CGIF4                          ((uint32_t)0x00001000)        /*!< Channel 4 Global interrupt clear */
#define  DMA_CTCIF4                         ((uint32_t)0x00002000)        /*!< Channel 4 Transfer Complete clear */
#define  DMA_CHTIF4                         ((uint32_t)0x00004000)        /*!< Channel 4 Half Transfer clear */
#define  DMA_CTEIF4                         ((uint32_t)0x00008000)        /*!< Channel 4 Transfer Error clear */
#define  DMA_CGIF5                          ((uint32_t)0x00010000)        /*!< Channel 5 Global interrupt clear */
#define  DMA_CTCIF5                         ((uint32_t)0x00020000)        /*!< Channel 5 Transfer Complete clear */
#define  DMA_CHTIF5                         ((uint32_t)0x00040000)        /*!< Channel 5 Half Transfer clear */
#define  DMA_CTEIF5                         ((uint32_t)0x00080000)        /*!< Channel 5 Transfer Error clear */
#define  DMA_CGIF6                          ((uint32_t)0x00100000)        /*!< Channel 6 Global interrupt clear */
#define  DMA_CTCIF6                         ((uint32_t)0x00200000)        /*!< Channel 6 Transfer Complete clear */
#define  DMA_CHTIF6                         ((uint32_t)0x00400000)        /*!< Channel 6 Half Transfer clear */
#define  DMA_CTEIF6                         ((uint32_t)0x00800000)        /*!< Channel 6 Transfer Error clear */
#define  DMA_CGIF7                          ((uint32_t)0x01000000)        /*!< Channel 7 Global interrupt clear */
#define  DMA_CTCIF7                         ((uint32_t)0x02000000)        /*!< Channel 7 Transfer Complete clear */
#define  DMA_CHTIF7                         ((uint32_t)0x04000000)        /*!< Channel 7 Half Transfer clear */
#define  DMA_CTEIF7                         ((uint32_t)0x08000000)        /*!< Channel 7 Transfer Error clear */

/*******************  Bit definition for DMA_CFGR1 register  *******************/
#define  DMA_CFGR1_EN                       ((uint16_t)0x0001)            /*!< Channel enable*/
#define  DMA_CFGR1_TCIE                     ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CFGR1_HTIE                     ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CFGR1_TEIE                     ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CFGR1_DIR                      ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CFGR1_CIRC                     ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CFGR1_PINC                     ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CFGR1_MINC                     ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CFGR1_PSIZE                    ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR1_PSIZE_0                  ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CFGR1_PSIZE_1                  ((uint16_t)0x0200)            /*!< Bit 1 */

