RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/*******************  Bit definition for DMA_CFG6 register  *******************/
#define  DMA_CFG6_EN                        ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CFG6_TCIE                      ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CFG6_HTIE                      ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CFG6_TEIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CFG6_DIR                       ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CFG6_CIRC                      ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CFG6_PINC                      ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CFG6_MINC                      ((uint16_t)0x0080)            /*!< Memory increment mode */
             
#define  DMA_CFG6_PSIZE                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFG6_PSIZE_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CFG6_PSIZE_1                   ((uint16_t)0x0200)            /*!< Bit 1 */
             
#define  DMA_CFG6_MSIZE                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CFG6_MSIZE_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CFG6_MSIZE_1                   ((uint16_t)0x0800)            /*!< Bit 1 */
             
#define  DMA_CFG6_PL                        ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CFG6_PL_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CFG6_PL_1                      ((uint16_t)0x2000)            /*!< Bit 1 */
             
#define  DMA_CFG6_MEM2MEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*******************  Bit definition for DMA_CFG7 register  *******************/
#define  DMA_CFG7_EN                        ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CFG7_TCIE                      ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CFG7_HTIE                      ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CFG7_TEIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CFG7_DIR                       ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CFG7_CIRC                      ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CFG7_PINC                      ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CFG7_MINC                      ((uint16_t)0x0080)            /*!< Memory increment mode */
             
#define  DMA_CFG7_PSIZE            ,        ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFG7_PSIZE_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CFG7_PSIZE_1                   ((uint16_t)0x0200)            /*!< Bit 1 */
             
#define  DMA_CFG7_MSIZE                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CFG7_MSIZE_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CFG7_MSIZE_1                   ((uint16_t)0x0800)            /*!< Bit 1 */
             
#define  DMA_CFG7_PL                        ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CFG7_PL_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CFG7_PL_1                      ((uint16_t)0x2000)            /*!< Bit 1 */
             
#define  DMA_CFG7_MEM2MEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode enable */

/******************  Bit definition for DMA_CNTR1 register  ******************/
#define  DMA_CNTR1_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR2 register  ******************/
#define  DMA_CNTR2_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR3 register  ******************/
#define  DMA_CNTR3_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR4 register  ******************/
#define  DMA_CNTR4_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR5 register  ******************/
#define  DMA_CNTR5_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR6 register  ******************/
#define  DMA_CNTR6_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNTR7 register  ******************/
#define  DMA_CNTR7_NDT                      ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_PADDR1 register  *******************/
#define  DMA_PADDR1_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_PADDR2 register  *******************/
#define  DMA_PADDR2_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_PADDR3 register  *******************/
#define  DMA_PADDR3_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */


/******************  Bit definition for DMA_PADDR4 register  *******************/
#define  DMA_PADDR4_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

