RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/******************  Bit definition for DMA_PADDR5 register  *******************/
#define  DMA_PADDR5_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_PADDR6 register  *******************/
#define  DMA_PADDR6_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */


/******************  Bit definition for DMA_PADDR7 register  *******************/
#define  DMA_PADDR7_PA                      ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_MADDR1 register  *******************/
#define  DMA_MADDR1_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_MADDR2 register  *******************/
#define  DMA_MADDR2_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_MADDR3 register  *******************/
#define  DMA_MADDR3_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */


/******************  Bit definition for DMA_MADDR4 register  *******************/
#define  DMA_MADDR4_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_MADDR5 register  *******************/
#define  DMA_MADDR5_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_MADDR6 register  *******************/
#define  DMA_MADDR6_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_MADDR7 register  *******************/
#define  DMA_MADDR7_MA                      ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define  DBGMCU_IDCODE_DEV_ID                ((uint32_t)0x00000FFF)        /*!< Device Identifier */

#define  DBGMCU_IDCODE_REV_ID                ((uint32_t)0xFFFF0000)        /*!< REV_ID[15:0] bits (Revision Identifier) */
#define  DBGMCU_IDCODE_REV_ID_0              ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  DBGMCU_IDCODE_REV_ID_1              ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  DBGMCU_IDCODE_REV_ID_2              ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  DBGMCU_IDCODE_REV_ID_3              ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  DBGMCU_IDCODE_REV_ID_4              ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  DBGMCU_IDCODE_REV_ID_5              ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  DBGMCU_IDCODE_REV_ID_6              ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  DBGMCU_IDCODE_REV_ID_7              ((uint32_t)0x00800000)        /*!< Bit 7 */
#define  DBGMCU_IDCODE_REV_ID_8              ((uint32_t)0x01000000)        /*!< Bit 8 */
#define  DBGMCU_IDCODE_REV_ID_9              ((uint32_t)0x02000000)        /*!< Bit 9 */
#define  DBGMCU_IDCODE_REV_ID_10             ((uint32_t)0x04000000)        /*!< Bit 10 */
#define  DBGMCU_IDCODE_REV_ID_11             ((uint32_t)0x08000000)        /*!< Bit 11 */
#define  DBGMCU_IDCODE_REV_ID_12             ((uint32_t)0x10000000)        /*!< Bit 12 */
#define  DBGMCU_IDCODE_REV_ID_13             ((uint32_t)0x20000000)        /*!< Bit 13 */
#define  DBGMCU_IDCODE_REV_ID_14             ((uint32_t)0x40000000)        /*!< Bit 14 */
#define  DBGMCU_IDCODE_REV_ID_15             ((uint32_t)0x80000000)        /*!< Bit 15 */

/******************  Bit definition for DBGMCU_CFGR register  *******************/
#define  DBGMCU_DBG_SLEEP                    ((uint32_t)0x00000001)        /*!< Debug Sleep Mode */
#define  DBGMCU_DBG_STOP                     ((uint32_t)0x00000002)        /*!< Debug Stop Mode */
#define  DBGMCU_DBG_STANDBY                  ((uint32_t)0x00000004)        /*!< Debug Standby mode */
#define  DBGMCU_TRACE_IOEN                   ((uint32_t)0x00000020)        /*!< Trace Pin Assignment Control */

#define  DBGMCU_TRACE_MODE                   ((uint32_t)0x000000C0)        /*!< TRACE_MODE[1:0] bits (Trace Pin Assignment Control) */
#define  DBGMCU_TRACE_MODE_0                 ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  DBGMCU_TRACE_MODE_1                 ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  DBGMCU_DBG_IWDG_STOP                ((uint32_t)0x00000100)        /*!< Debug Independent Watchdog stopped when Core is halted */
#define  DBGMCU_DBG_WWDG_STOP                ((uint32_t)0x00000200)        /*!< Debug Window Watchdog stopped when Core is halted */
#define  DBGMCU_DBG_TIM1_STOP                ((uint32_t)0x00000400)        /*!< TIM1 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM2_STOP                ((uint32_t)0x00000800)        /*!< TIM2 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM3_STOP                ((uint32_t)0x00001000)        /*!< TIM3 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM4_STOP                ((uint32_t)0x00002000)        /*!< TIM4 counter stopped when core is halted */
#define  DBGMCU_DBG_CAN1_STOP                ((uint32_t)0x00004000)        /*!< Debug CAN1 stopped when Core is halted */
#define  DBGMCU_DBG_I2C1_SMBUS_TIMEOUT       ((uint32_t)0x00008000)        /*!< SMBUS timeout mode stopped when Core is halted */
#define  DBGMCU_DBG_I2C2_SMBUS_TIMEOUT       ((uint32_t)0x00010000)        /*!< SMBUS timeout mode stopped when Core is halted */
#define  DBGMCU_DBG_TIM8_STOP                ((uint32_t)0x00020000)        /*!< TIM8 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM5_STOP                ((uint32_t)0x00040000)        /*!< TIM5 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM6_STOP                ((uint32_t)0x00080000)        /*!< TIM6 counter stopped when core is halted */
#define  DBGMCU_DBG_TIM7_STOP                ((uint32_t)0x00100000)        /*!< TIM7 counter stopped when core is halted */
#define  DBGMCU_DBG_CAN2_STOP                ((uint32_t)0x00200000)        /*!< Debug CAN2 stopped when Core is halted */
#define  DBGMCU_DBG_TIM15_STOP               ((uint32_t)0x00400000)        /*!< Debug TIM15 stopped when Core is halted */
#define  DBGMCU_DBG_TIM16_STOP               ((uint32_t)0x00800000)        /*!< Debug TIM16 stopped when Core is halted */
#define  DBGMCU_DBG_TIM17_STOP               ((uint32_t)0x01000000)        /*!< Debug TIM17 stopped when Core is halted */
#define  DBGMCU_DBG_TIM12_STOP               ((uint32_t)0x02000000)        /*!< Debug TIM12 stopped when Core is halted */
#define  DBGMCU_DBG_TIM13_STOP               ((uint32_t)0x04000000)        /*!< Debug TIM13 stopped when Core is halted */
#define  DBGMCU_DBG_TIM14_STOP               ((uint32_t)0x08000000)        /*!< Debug TIM14 stopped when Core is halted */
#define  DBGMCU_DBG_TIM9_STOP                ((uint32_t)0x10000000)        /*!< Debug TIM9 stopped when Core is halted */
#define  DBGMCU_DBG_TIM10_STOP               ((uint32_t)0x20000000)        /*!< Debug TIM10 stopped when Core is halted */
#define  DBGMCU_DBG_TIM11_STOP               ((uint32_t)0x40000000)        /*!< Debug TIM11 stopped when Core is halted */

/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for EXTI_INTENR register  *******************/
#define  EXTI_INTENR_MR0                        ((uint32_t)0x00000001)        /*!< Interrupt Mask on line 0 */
#define  EXTI_INTENR_MR1                        ((uint32_t)0x00000002)        /*!< Interrupt Mask on line 1 */
#define  EXTI_INTENR_MR2                        ((uint32_t)0x00000004)        /*!< Interrupt Mask on line 2 */
#define  EXTI_INTENR_MR3                        ((uint32_t)0x00000008)        /*!< Interrupt Mask on line 3 */
#define  EXTI_INTENR_MR4                        ((uint32_t)0x00000010)        /*!< Interrupt Mask on line 4 */
#define  EXTI_INTENR_MR5                        ((uint32_t)0x00000020)        /*!< Interrupt Mask on line 5 */
#define  EXTI_INTENR_MR6                        ((uint32_t)0x00000040)        /*!< Interrupt Mask on line 6 */
#define  EXTI_INTENR_MR7                        ((uint32_t)0x00000080)        /*!< Interrupt Mask on line 7 */
#define  EXTI_INTENR_MR8                        ((uint32_t)0x00000100)        /*!< Interrupt Mask on line 8 */
#define  EXTI_INTENR_MR9                        ((uint32_t)0x00000200)        /*!< Interrupt Mask on line 9 */
#define  EXTI_INTENR_MR10                       ((uint32_t)0x00000400)        /*!< Interrupt Mask on line 10 */
#define  EXTI_INTENR_MR11                       ((uint32_t)0x00000800)        /*!< Interrupt Mask on line 11 */
#define  EXTI_INTENR_MR12                       ((uint32_t)0x00001000)        /*!< Interrupt Mask on line 12 */
#define  EXTI_INTENR_MR13                       ((uint32_t)0x00002000)        /*!< Interrupt Mask on line 13 */
#define  EXTI_INTENR_MR14                       ((uint32_t)0x00004000)        /*!< Interrupt Mask on line 14 */
#define  EXTI_INTENR_MR15                       ((uint32_t)0x00008000)        /*!< Interrupt Mask on line 15 */
#define  EXTI_INTENR_MR16                       ((uint32_t)0x00010000)        /*!< Interrupt Mask on line 16 */
#define  EXTI_INTENR_MR17                       ((uint32_t)0x00020000)        /*!< Interrupt Mask on line 17 */
#define  EXTI_INTENR_MR18                       ((uint32_t)0x00040000)        /*!< Interrupt Mask on line 18 */
#define  EXTI_INTENR_MR19                       ((uint32_t)0x00080000)        /*!< Interrupt Mask on line 19 */

/*******************  Bit definition for EXTI_EVENR register  *******************/
#define  EXTI_EVENR_MR0                         ((uint32_t)0x00000001)        /*!< Event Mask on line 0 */
#define  EXTI_EVENR_MR1                         ((uint32_t)0x00000002)        /*!< Event Mask on line 1 */
#define  EXTI_EVENR_MR2                         ((uint32_t)0x00000004)        /*!< Event Mask on line 2 */
#define  EXTI_EVENR_MR3                         ((uint32_t)0x00000008)        /*!< Event Mask on line 3 */
#define  EXTI_EVENR_MR4                         ((uint32_t)0x00000010)        /*!< Event Mask on line 4 */
#define  EXTI_EVENR_MR5                         ((uint32_t)0x00000020)        /*!< Event Mask on line 5 */
#define  EXTI_EVENR_MR6                         ((uint32_t)0x00000040)        /*!< Event Mask on line 6 */
#define  EXTI_EVENR_MR7                         ((uint32_t)0x00000080)        /*!< Event Mask on line 7 */
#define  EXTI_EVENR_MR8                         ((uint32_t)0x00000100)        /*!< Event Mask on line 8 */
#define  EXTI_EVENR_MR9                         ((uint32_t)0x00000200)        /*!< Event Mask on line 9 */
#define  EXTI_EVENR_MR10                        ((uint32_t)0x00000400)        /*!< Event Mask on line 10 */
#define  EXTI_EVENR_MR11                        ((uint32_t)0x00000800)        /*!< Event Mask on line 11 */
#define  EXTI_EVENR_MR12                        ((uint32_t)0x00001000)        /*!< Event Mask on line 12 */
#define  EXTI_EVENR_MR13                        ((uint32_t)0x00002000)        /*!< Event Mask on line 13 */
#define  EXTI_EVENR_MR14                        ((uint32_t)0x00004000)        /*!< Event Mask on line 14 */
#define  EXTI_EVENR_MR15                        ((uint32_t)0x00008000)        /*!< Event Mask on line 15 */
#define  EXTI_EVENR_MR16                        ((uint32_t)0x00010000)        /*!< Event Mask on line 16 */
#define  EXTI_EVENR_MR17                        ((uint32_t)0x00020000)        /*!< Event Mask on line 17 */
#define  EXTI_EVENR_MR18                        ((uint32_t)0x00040000)        /*!< Event Mask on line 18 */
#define  EXTI_EVENR_MR19                        ((uint32_t)0x00080000)        /*!< Event Mask on line 19 */

