RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/******************  Bit definition for EXTI_RTENR register  *******************/
#define  EXTI_RTENR_TR0                         ((uint32_t)0x00000001)        /*!< Rising trigger event configuration bit of line 0 */
#define  EXTI_RTENR_TR1                         ((uint32_t)0x00000002)        /*!< Rising trigger event configuration bit of line 1 */
#define  EXTI_RTENR_TR2                         ((uint32_t)0x00000004)        /*!< Rising trigger event configuration bit of line 2 */
#define  EXTI_RTENR_TR3                         ((uint32_t)0x00000008)        /*!< Rising trigger event configuration bit of line 3 */
#define  EXTI_RTENR_TR4                         ((uint32_t)0x00000010)        /*!< Rising trigger event configuration bit of line 4 */
#define  EXTI_RTENR_TR5                         ((uint32_t)0x00000020)        /*!< Rising trigger event configuration bit of line 5 */
#define  EXTI_RTENR_TR6                         ((uint32_t)0x00000040)        /*!< Rising trigger event configuration bit of line 6 */
#define  EXTI_RTENR_TR7                         ((uint32_t)0x00000080)        /*!< Rising trigger event configuration bit of line 7 */
#define  EXTI_RTENR_TR8                         ((uint32_t)0x00000100)        /*!< Rising trigger event configuration bit of line 8 */
#define  EXTI_RTENR_TR9                         ((uint32_t)0x00000200)        /*!< Rising trigger event configuration bit of line 9 */
#define  EXTI_RTENR_TR10                        ((uint32_t)0x00000400)        /*!< Rising trigger event configuration bit of line 10 */
#define  EXTI_RTENR_TR11                        ((uint32_t)0x00000800)        /*!< Rising trigger event configuration bit of line 11 */
#define  EXTI_RTENR_TR12                        ((uint32_t)0x00001000)        /*!< Rising trigger event configuration bit of line 12 */
#define  EXTI_RTENR_TR13                        ((uint32_t)0x00002000)        /*!< Rising trigger event configuration bit of line 13 */
#define  EXTI_RTENR_TR14                        ((uint32_t)0x00004000)        /*!< Rising trigger event configuration bit of line 14 */
#define  EXTI_RTENR_TR15                        ((uint32_t)0x00008000)        /*!< Rising trigger event configuration bit of line 15 */
#define  EXTI_RTENR_TR16                        ((uint32_t)0x00010000)        /*!< Rising trigger event configuration bit of line 16 */
#define  EXTI_RTENR_TR17                        ((uint32_t)0x00020000)        /*!< Rising trigger event configuration bit of line 17 */
#define  EXTI_RTENR_TR18                        ((uint32_t)0x00040000)        /*!< Rising trigger event configuration bit of line 18 */
#define  EXTI_RTENR_TR19                        ((uint32_t)0x00080000)        /*!< Rising trigger event configuration bit of line 19 */

/******************  Bit definition for EXTI_FTENR register  *******************/
#define  EXTI_FTENR_TR0                         ((uint32_t)0x00000001)        /*!< Falling trigger event configuration bit of line 0 */
#define  EXTI_FTENR_TR1                         ((uint32_t)0x00000002)        /*!< Falling trigger event configuration bit of line 1 */
#define  EXTI_FTENR_TR2                         ((uint32_t)0x00000004)        /*!< Falling trigger event configuration bit of line 2 */
#define  EXTI_FTENR_TR3                         ((uint32_t)0x00000008)        /*!< Falling trigger event configuration bit of line 3 */
#define  EXTI_FTENR_TR4                         ((uint32_t)0x00000010)        /*!< Falling trigger event configuration bit of line 4 */
#define  EXTI_FTENR_TR5                         ((uint32_t)0x00000020)        /*!< Falling trigger event configuration bit of line 5 */
#define  EXTI_FTENR_TR6                         ((uint32_t)0x00000040)        /*!< Falling trigger event configuration bit of line 6 */
#define  EXTI_FTENR_TR7                         ((uint32_t)0x00000080)        /*!< Falling trigger event configuration bit of line 7 */
#define  EXTI_FTENR_TR8                         ((uint32_t)0x00000100)        /*!< Falling trigger event configuration bit of line 8 */
#define  EXTI_FTENR_TR9                         ((uint32_t)0x00000200)        /*!< Falling trigger event configuration bit of line 9 */
#define  EXTI_FTENR_TR10                        ((uint32_t)0x00000400)        /*!< Falling trigger event configuration bit of line 10 */
#define  EXTI_FTENR_TR11                        ((uint32_t)0x00000800)        /*!< Falling trigger event configuration bit of line 11 */
#define  EXTI_FTENR_TR12                        ((uint32_t)0x00001000)        /*!< Falling trigger event configuration bit of line 12 */
#define  EXTI_FTENR_TR13                        ((uint32_t)0x00002000)        /*!< Falling trigger event configuration bit of line 13 */
#define  EXTI_FTENR_TR14                        ((uint32_t)0x00004000)        /*!< Falling trigger event configuration bit of line 14 */
#define  EXTI_FTENR_TR15                        ((uint32_t)0x00008000)        /*!< Falling trigger event configuration bit of line 15 */
#define  EXTI_FTENR_TR16                        ((uint32_t)0x00010000)        /*!< Falling trigger event configuration bit of line 16 */
#define  EXTI_FTENR_TR17                        ((uint32_t)0x00020000)        /*!< Falling trigger event configuration bit of line 17 */
#define  EXTI_FTENR_TR18                        ((uint32_t)0x00040000)        /*!< Falling trigger event configuration bit of line 18 */
#define  EXTI_FTENR_TR19                        ((uint32_t)0x00080000)        /*!< Falling trigger event configuration bit of line 19 */

/******************  Bit definition for EXTI_SWIEVR register  ******************/
#define  EXTI_SWIEVR_SWIEVR0                    ((uint32_t)0x00000001)        /*!< Software Interrupt on line 0 */
#define  EXTI_SWIEVR_SWIEVR1                    ((uint32_t)0x00000002)        /*!< Software Interrupt on line 1 */
#define  EXTI_SWIEVR_SWIEVR2                    ((uint32_t)0x00000004)        /*!< Software Interrupt on line 2 */
#define  EXTI_SWIEVR_SWIEVR3                    ((uint32_t)0x00000008)        /*!< Software Interrupt on line 3 */
#define  EXTI_SWIEVR_SWIEVR4                    ((uint32_t)0x00000010)        /*!< Software Interrupt on line 4 */
#define  EXTI_SWIEVR_SWIEVR5                    ((uint32_t)0x00000020)        /*!< Software Interrupt on line 5 */
#define  EXTI_SWIEVR_SWIEVR6                    ((uint32_t)0x00000040)        /*!< Software Interrupt on line 6 */
#define  EXTI_SWIEVR_SWIEVR7                    ((uint32_t)0x00000080)        /*!< Software Interrupt on line 7 */
#define  EXTI_SWIEVR_SWIEVR8                    ((uint32_t)0x00000100)        /*!< Software Interrupt on line 8 */
#define  EXTI_SWIEVR_SWIEVR9                    ((uint32_t)0x00000200)        /*!< Software Interrupt on line 9 */
#define  EXTI_SWIEVR_SWIEVR10                   ((uint32_t)0x00000400)        /*!< Software Interrupt on line 10 */
#define  EXTI_SWIEVR_SWIEVR11                   ((uint32_t)0x00000800)        /*!< Software Interrupt on line 11 */
#define  EXTI_SWIEVR_SWIEVR12                   ((uint32_t)0x00001000)        /*!< Software Interrupt on line 12 */
#define  EXTI_SWIEVR_SWIEVR13                   ((uint32_t)0x00002000)        /*!< Software Interrupt on line 13 */
#define  EXTI_SWIEVR_SWIEVR14                   ((uint32_t)0x00004000)        /*!< Software Interrupt on line 14 */
#define  EXTI_SWIEVR_SWIEVR15                   ((uint32_t)0x00008000)        /*!< Software Interrupt on line 15 */
#define  EXTI_SWIEVR_SWIEVR16                   ((uint32_t)0x00010000)        /*!< Software Interrupt on line 16 */
#define  EXTI_SWIEVR_SWIEVR17                   ((uint32_t)0x00020000)        /*!< Software Interrupt on line 17 */
#define  EXTI_SWIEVR_SWIEVR18                   ((uint32_t)0x00040000)        /*!< Software Interrupt on line 18 */
#define  EXTI_SWIEVR_SWIEVR19                   ((uint32_t)0x00080000)        /*!< Software Interrupt on line 19 */

/*******************  Bit definition for EXTI_INTFR register  ********************/
#define  EXTI_INTF_INTF0                        ((uint32_t)0x00000001)        /*!< Pending bit for line 0 */
#define  EXTI_INTF_INTF1                        ((uint32_t)0x00000002)        /*!< Pending bit for line 1 */
#define  EXTI_INTF_INTF2                        ((uint32_t)0x00000004)        /*!< Pending bit for line 2 */
#define  EXTI_INTF_INTF3                        ((uint32_t)0x00000008)        /*!< Pending bit for line 3 */
#define  EXTI_INTF_INTF4                        ((uint32_t)0x00000010)        /*!< Pending bit for line 4 */
#define  EXTI_INTF_INTF5                        ((uint32_t)0x00000020)        /*!< Pending bit for line 5 */
#define  EXTI_INTF_INTF6                        ((uint32_t)0x00000040)        /*!< Pending bit for line 6 */
#define  EXTI_INTF_INTF7                        ((uint32_t)0x00000080)        /*!< Pending bit for line 7 */
#define  EXTI_INTF_INTF8                        ((uint32_t)0x00000100)        /*!< Pending bit for line 8 */
#define  EXTI_INTF_INTF9                        ((uint32_t)0x00000200)        /*!< Pending bit for line 9 */
#define  EXTI_INTF_INTF10                       ((uint32_t)0x00000400)        /*!< Pending bit for line 10 */
#define  EXTI_INTF_INTF11                       ((uint32_t)0x00000800)        /*!< Pending bit for line 11 */
#define  EXTI_INTF_INTF12                       ((uint32_t)0x00001000)        /*!< Pending bit for line 12 */
#define  EXTI_INTF_INTF13                       ((uint32_t)0x00002000)        /*!< Pending bit for line 13 */
#define  EXTI_INTF_INTF14                       ((uint32_t)0x00004000)        /*!< Pending bit for line 14 */
#define  EXTI_INTF_INTF15                       ((uint32_t)0x00008000)        /*!< Pending bit for line 15 */
#define  EXTI_INTF_INTF16                       ((uint32_t)0x00010000)        /*!< Pending bit for line 16 */
#define  EXTI_INTF_INTF17                       ((uint32_t)0x00020000)        /*!< Pending bit for line 17 */
#define  EXTI_INTF_INTF18                       ((uint32_t)0x00040000)        /*!< Pending bit for line 18 */
#define  EXTI_INTF_INTF19                       ((uint32_t)0x00080000)        /*!< Pending bit for line 19 */

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/


