RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
/*******************  Bit definition for SCB_afsr register  *******************/
#define  SCB_AFSR_IMPDEF                     ((uint32_t)0xFFFFFFFF)        /*!< Implementation defined */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CTLR register  ********************/
#define  PWR_CTLR_LPDS                         ((uint16_t)0x0001)     /*!< Low-Power Deepsleep */
#define  PWR_CTLR_PDDS                         ((uint16_t)0x0002)     /*!< Power Down Deepsleep */
#define  PWR_CTLR_CWUF                         ((uint16_t)0x0004)     /*!< Clear Wakeup Flag */
#define  PWR_CTLR_CSBF                         ((uint16_t)0x0008)     /*!< Clear Standby Flag */
#define  PWR_CTLR_PVDE                         ((uint16_t)0x0010)     /*!< Power Voltage Detector Enable */

#define  PWR_CTLR_PLS                          ((uint16_t)0x00E0)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CTLR_PLS_0                        ((uint16_t)0x0020)     /*!< Bit 0 */
#define  PWR_CTLR_PLS_1                        ((uint16_t)0x0040)     /*!< Bit 1 */
#define  PWR_CTLR_PLS_2                        ((uint16_t)0x0080)     /*!< Bit 2 */

/*!< PVD level configuration */
#define  PWR_CTLR_PLS_2V2                      ((uint16_t)0x0000)     /*!< PVD level 2.2V */
#define  PWR_CTLR_PLS_2V3                      ((uint16_t)0x0020)     /*!< PVD level 2.3V */
#define  PWR_CTLR_PLS_2V4                      ((uint16_t)0x0040)     /*!< PVD level 2.4V */
#define  PWR_CTLR_PLS_2V5                      ((uint16_t)0x0060)     /*!< PVD level 2.5V */
#define  PWR_CTLR_PLS_2V6                      ((uint16_t)0x0080)     /*!< PVD level 2.6V */
#define  PWR_CTLR_PLS_2V7                      ((uint16_t)0x00A0)     /*!< PVD level 2.7V */
#define  PWR_CTLR_PLS_2V8                      ((uint16_t)0x00C0)     /*!< PVD level 2.8V */
#define  PWR_CTLR_PLS_2V9                      ((uint16_t)0x00E0)     /*!< PVD level 2.9V */

#define  PWR_CTLR_DBP                          ((uint16_t)0x0100)     /*!< Disable Backup Domain write protection */


/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                           ((uint16_t)0x0001)     /*!< Wakeup Flag */
#define  PWR_CSR_SBF                           ((uint16_t)0x0002)     /*!< Standby Flag */
#define  PWR_CSR_PVDO                          ((uint16_t)0x0004)     /*!< PVD Output */
#define  PWR_CSR_EWUP                          ((uint16_t)0x0100)     /*!< Enable WKUP pin */



/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTLR register  ********************/
#define  RCC_HSION                       ((uint32_t)0x00000001)        /*!< Internal High Speed clock enable */
#define  RCC_HSIRDY                      ((uint32_t)0x00000002)        /*!< Internal High Speed clock ready flag */
#define  RCC_HSITRIM                     ((uint32_t)0x000000F8)        /*!< Internal High Speed clock trimming */
#define  RCC_HSICAL                      ((uint32_t)0x0000FF00)        /*!< Internal High Speed clock Calibration */
#define  RCC_HSEON                       ((uint32_t)0x00010000)        /*!< External High Speed clock enable */
#define  RCC_HSERDY                      ((uint32_t)0x00020000)        /*!< External High Speed clock ready flag */
#define  RCC_HSEBYP                      ((uint32_t)0x00040000)        /*!< External High Speed clock Bypass */
#define  RCC_CSSON                       ((uint32_t)0x00080000)        /*!< Clock Security System enable */
#define  RCC_PLLON                       ((uint32_t)0x01000000)        /*!< PLL enable */
#define  RCC_PLLRDY                      ((uint32_t)0x02000000)        /*!< PLL clock ready flag */


/*******************  Bit definition for RCC_CFGR0 register  *******************/
/*!< SW configuration */
#define  RCC_SW                          ((uint32_t)0x00000003)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_SW_0                        ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  RCC_SW_1                        ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  RCC_SW_HSI                      ((uint32_t)0x00000000)        /*!< HSI selected as system clock */
#define  RCC_SW_HSE                      ((uint32_t)0x00000001)        /*!< HSE selected as system clock */
#define  RCC_SW_PLL                      ((uint32_t)0x00000002)        /*!< PLL selected as system clock */

/*!< SWS configuration */
#define  RCC_SWS                         ((uint32_t)0x0000000C)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_SWS_0                       ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  RCC_SWS_1                       ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  RCC_SWS_HSI                     ((uint32_t)0x00000000)        /*!< HSI oscillator used as system clock */
#define  RCC_SWS_HSE                     ((uint32_t)0x00000004)        /*!< HSE oscillator used as system clock */
#define  RCC_SWS_PLL                     ((uint32_t)0x00000008)        /*!< PLL used as system clock */

/*!< HPRE configuration */
#define  RCC_HPRE                        ((uint32_t)0x000000F0)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_HPRE_0                      ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  RCC_HPRE_1                      ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  RCC_HPRE_2                      ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  RCC_HPRE_3                      ((uint32_t)0x00000080)        /*!< Bit 3 */

