RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
#define  RCC_HPRE_DIV1                   ((uint32_t)0x00000000)        /*!< SYSCLK not divided */
#define  RCC_HPRE_DIV2                   ((uint32_t)0x00000080)        /*!< SYSCLK divided by 2 */
#define  RCC_HPRE_DIV4                   ((uint32_t)0x00000090)        /*!< SYSCLK divided by 4 */
#define  RCC_HPRE_DIV8                   ((uint32_t)0x000000A0)        /*!< SYSCLK divided by 8 */
#define  RCC_HPRE_DIV16                  ((uint32_t)0x000000B0)        /*!< SYSCLK divided by 16 */
#define  RCC_HPRE_DIV64                  ((uint32_t)0x000000C0)        /*!< SYSCLK divided by 64 */
#define  RCC_HPRE_DIV128                 ((uint32_t)0x000000D0)        /*!< SYSCLK divided by 128 */
#define  RCC_HPRE_DIV256                 ((uint32_t)0x000000E0)        /*!< SYSCLK divided by 256 */
#define  RCC_HPRE_DIV512                 ((uint32_t)0x000000F0)        /*!< SYSCLK divided by 512 */

/*!< PPRE1 configuration */
#define  RCC_PPRE1                       ((uint32_t)0x00000700)        /*!< PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_PPRE1_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  RCC_PPRE1_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  RCC_PPRE1_2                     ((uint32_t)0x00000400)        /*!< Bit 2 */

#define  RCC_PPRE1_DIV1                  ((uint32_t)0x00000000)        /*!< HCLK not divided */
#define  RCC_PPRE1_DIV2                  ((uint32_t)0x00000400)        /*!< HCLK divided by 2 */
#define  RCC_PPRE1_DIV4                  ((uint32_t)0x00000500)        /*!< HCLK divided by 4 */
#define  RCC_PPRE1_DIV8                  ((uint32_t)0x00000600)        /*!< HCLK divided by 8 */
#define  RCC_PPRE1_DIV16                 ((uint32_t)0x00000700)        /*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define  RCC_PPRE2                       ((uint32_t)0x00003800)        /*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_PPRE2_0                     ((uint32_t)0x00000800)        /*!< Bit 0 */
#define  RCC_PPRE2_1                     ((uint32_t)0x00001000)        /*!< Bit 1 */
#define  RCC_PPRE2_2                     ((uint32_t)0x00002000)        /*!< Bit 2 */

#define  RCC_PPRE2_DIV1                  ((uint32_t)0x00000000)        /*!< HCLK not divided */
#define  RCC_PPRE2_DIV2                  ((uint32_t)0x00002000)        /*!< HCLK divided by 2 */
#define  RCC_PPRE2_DIV4                  ((uint32_t)0x00002800)        /*!< HCLK divided by 4 */
#define  RCC_PPRE2_DIV8                  ((uint32_t)0x00003000)        /*!< HCLK divided by 8 */
#define  RCC_PPRE2_DIV16                 ((uint32_t)0x00003800)        /*!< HCLK divided by 16 */

/*!< ADCPPRE configuration */
#define  RCC_ADCPRE                      ((uint32_t)0x0000C000)        /*!< ADCPRE[1:0] bits (ADC prescaler) */
#define  RCC_ADCPRE_0                    ((uint32_t)0x00004000)        /*!< Bit 0 */
#define  RCC_ADCPRE_1                    ((uint32_t)0x00008000)        /*!< Bit 1 */

#define  RCC_ADCPRE_DIV2                 ((uint32_t)0x00000000)        /*!< PCLK2 divided by 2 */
#define  RCC_ADCPRE_DIV4                 ((uint32_t)0x00004000)        /*!< PCLK2 divided by 4 */
#define  RCC_ADCPRE_DIV6                 ((uint32_t)0x00008000)        /*!< PCLK2 divided by 6 */
#define  RCC_ADCPRE_DIV8                 ((uint32_t)0x0000C000)        /*!< PCLK2 divided by 8 */

#define  RCC_PLLSRC                      ((uint32_t)0x00010000)        /*!< PLL entry clock source */

#define  RCC_PLLXTPRE                    ((uint32_t)0x00020000)        /*!< HSE divider for PLL entry */

/*!< PLLMUL configuration */
#define  RCC_PLLMULL                     ((uint32_t)0x003C0000)        /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_PLLMULL_0                   ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  RCC_PLLMULL_1                   ((uint32_t)0x00080000)        /*!< Bit 1 */
#define  RCC_PLLMULL_2                   ((uint32_t)0x00100000)        /*!< Bit 2 */
#define  RCC_PLLMULL_3                   ((uint32_t)0x00200000)        /*!< Bit 3 */
 
#define  RCC_PLLSRC_HSI_Div2             ((uint32_t)0x00000000)        /*!< HSI clock divided by 2 selected as PLL entry clock source */
#define  RCC_PLLSRC_HSE                  ((uint32_t)0x00010000)        /*!< HSE clock selected as PLL entry clock source */
 
#define  RCC_PLLXTPRE_HSE                ((uint32_t)0x00000000)        /*!< HSE clock not divided for PLL entry */
#define  RCC_PLLXTPRE_HSE_Div2           ((uint32_t)0x00020000)        /*!< HSE clock divided by 2 for PLL entry */

#define  RCC_PLLMULL2                    ((uint32_t)0x00000000)        /*!< PLL input clock*2 */
#define  RCC_PLLMULL3                    ((uint32_t)0x00040000)        /*!< PLL input clock*3 */
#define  RCC_PLLMULL4                    ((uint32_t)0x00080000)        /*!< PLL input clock*4 */
#define  RCC_PLLMULL5                    ((uint32_t)0x000C0000)        /*!< PLL input clock*5 */
#define  RCC_PLLMULL6                    ((uint32_t)0x00100000)        /*!< PLL input clock*6 */
#define  RCC_PLLMULL7                    ((uint32_t)0x00140000)        /*!< PLL input clock*7 */
#define  RCC_PLLMULL8                    ((uint32_t)0x00180000)        /*!< PLL input clock*8 */
#define  RCC_PLLMULL9                    ((uint32_t)0x001C0000)        /*!< PLL input clock*9 */
#define  RCC_PLLMULL10                   ((uint32_t)0x00200000)        /*!< PLL input clock10 */
#define  RCC_PLLMULL11                   ((uint32_t)0x00240000)        /*!< PLL input clock*11 */
#define  RCC_PLLMULL12                   ((uint32_t)0x00280000)        /*!< PLL input clock*12 */
#define  RCC_PLLMULL13                   ((uint32_t)0x002C0000)        /*!< PLL input clock*13 */
#define  RCC_PLLMULL14                   ((uint32_t)0x00300000)        /*!< PLL input clock*14 */
#define  RCC_PLLMULL15                   ((uint32_t)0x00340000)        /*!< PLL input clock*15 */
#define  RCC_PLLMULL16                   ((uint32_t)0x00380000)        /*!< PLL input clock*16 */
#define  RCC_USBPRE                      ((uint32_t)0x00400000)        /*!< USB Device prescaler */

/*!< MCO configuration */
#define  RCC_CFGR0_MCO                   ((uint32_t)0x07000000)        /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define  RCC_MCO_0                       ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  RCC_MCO_1                       ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  RCC_MCO_2                       ((uint32_t)0x04000000)        /*!< Bit 2 */

#define  RCC_MCO_NOCLOCK                 ((uint32_t)0x00000000)        /*!< No clock */
#define  RCC_CFGR0_MCO_SYSCLK            ((uint32_t)0x04000000)        /*!< System clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSI               ((uint32_t)0x05000000)        /*!< HSI clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSE               ((uint32_t)0x06000000)        /*!< HSE clock selected as MCO source  */
#define  RCC_CFGR0_MCO_PLL               ((uint32_t)0x07000000)        /*!< PLL clock divided by 2 selected as MCO source */

/*!<******************  Bit definition for RCC_INTR register  ********************/
#define  RCC_LSIRDYF                     ((uint32_t)0x00000001)        /*!< LSI Ready Interrupt flag */
#define  RCC_LSERDYF                     ((uint32_t)0x00000002)        /*!< LSE Ready Interrupt flag */
#define  RCC_HSIRDYF                     ((uint32_t)0x00000004)        /*!< HSI Ready Interrupt flag */
#define  RCC_HSERDYF                     ((uint32_t)0x00000008)        /*!< HSE Ready Interrupt flag */
#define  RCC_PLLRDYF                     ((uint32_t)0x00000010)        /*!< PLL Ready Interrupt flag */
#define  RCC_CSSF                        ((uint32_t)0x00000080)        /*!< Clock Security System Interrupt flag */
#define  RCC_LSIRDYIE                    ((uint32_t)0x00000100)        /*!< LSI Ready Interrupt Enable */
#define  RCC_LSERDYIE                    ((uint32_t)0x00000200)        /*!< LSE Ready Interrupt Enable */
#define  RCC_HSIRDYIE                    ((uint32_t)0x00000400)        /*!< HSI Ready Interrupt Enable */
#define  RCC_HSERDYIE                    ((uint32_t)0x00000800)        /*!< HSE Ready Interrupt Enable */
#define  RCC_PLLRDYIE                    ((uint32_t)0x00001000)        /*!< PLL Ready Interrupt Enable */
#define  RCC_LSIRDYC                     ((uint32_t)0x00010000)        /*!< LSI Ready Interrupt Clear */
#define  RCC_LSERDYC                     ((uint32_t)0x00020000)        /*!< LSE Ready Interrupt Clear */
#define  RCC_HSIRDYC                     ((uint32_t)0x00040000)        /*!< HSI Ready Interrupt Clear */
#define  RCC_HSERDYC                     ((uint32_t)0x00080000)        /*!< HSE Ready Interrupt Clear */
#define  RCC_PLLRDYC                     ((uint32_t)0x00100000)        /*!< PLL Ready Interrupt Clear */
#define  RCC_CSSC                        ((uint32_t)0x00800000)        /*!< Clock Security System Interrupt Clear */


/*****************  Bit definition for RCC_APB2PRSTR register  *****************/
#define  RCC_AFIORST                     ((uint32_t)0x00000001)        /*!< Alternate Function I/O reset */
#define  RCC_IOPARST                     ((uint32_t)0x00000004)        /*!< I/O port A reset */
#define  RCC_IOPBRST                     ((uint32_t)0x00000008)        /*!< I/O port B reset */
#define  RCC_IOPCRST                     ((uint32_t)0x00000010)        /*!< I/O port C reset */
#define  RCC_IOPDRST                     ((uint32_t)0x00000020)        /*!< I/O port D reset */
#define  RCC_ADC1RST                     ((uint32_t)0x00000200)        /*!< ADC 1 interface reset */


#define  RCC_ADC2RST                     ((uint32_t)0x00000400)        /*!< ADC 2 interface reset */


