RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x.h
#define  RCC_TIM1RST                     ((uint32_t)0x00000800)        /*!< TIM1 Timer reset */
#define  RCC_SPI1RST                     ((uint32_t)0x00001000)        /*!< SPI 1 reset */
#define  RCC_USART1RST                   ((uint32_t)0x00004000)        /*!< USART1 reset */

#define  RCC_IOPERST                     ((uint32_t)0x00000040)        /*!< I/O port E reset */

/*****************  Bit definition for RCC_APB1PRSTR register  *****************/
#define  RCC_TIM2RST                     ((uint32_t)0x00000001)        /*!< Timer 2 reset */
#define  RCC_TIM3RST                     ((uint32_t)0x00000002)        /*!< Timer 3 reset */
#define  RCC_WWDGRST                     ((uint32_t)0x00000800)        /*!< Window Watchdog reset */
#define  RCC_USART2RST                   ((uint32_t)0x00020000)        /*!< USART 2 reset */
#define  RCC_I2C1RST                     ((uint32_t)0x00200000)        /*!< I2C 1 reset */
  
#define  RCC_CAN1RST                     ((uint32_t)0x02000000)        /*!< CAN1 reset */


#define  RCC_BKPRST                      ((uint32_t)0x08000000)        /*!< Backup interface reset */
#define  RCC_PWRRST                      ((uint32_t)0x10000000)        /*!< Power interface reset */


#define  RCC_TIM4RST                     ((uint32_t)0x00000004)        /*!< Timer 4 reset */
#define  RCC_SPI2RST                     ((uint32_t)0x00004000)        /*!< SPI 2 reset */
#define  RCC_USART3RST                   ((uint32_t)0x00040000)        /*!< USART 3 reset */
#define  RCC_I2C2RST                     ((uint32_t)0x00400000)        /*!< I2C 2 reset */

#define  RCC_USBRST                      ((uint32_t)0x00800000)        /*!< USB Device reset */

/******************  Bit definition for RCC_AHBPCENR register  ******************/
#define  RCC_DMA1EN                      ((uint16_t)0x0001)            /*!< DMA1 clock enable */
#define  RCC_SRAMEN                      ((uint16_t)0x0004)            /*!< SRAM interface clock enable */
#define  RCC_FLITFEN                     ((uint16_t)0x0010)            /*!< FLITF clock enable */
#define  RCC_CRCEN                       ((uint16_t)0x0040)            /*!< CRC clock enable */

/******************  Bit definition for RCC_APB2PCENR register  *****************/
#define  RCC_AFIOEN                      ((uint32_t)0x00000001)         /*!< Alternate Function I/O clock enable */
#define  RCC_IOPAEN                      ((uint32_t)0x00000004)         /*!< I/O port A clock enable */
#define  RCC_IOPBEN                      ((uint32_t)0x00000008)         /*!< I/O port B clock enable */
#define  RCC_IOPCEN                      ((uint32_t)0x00000010)         /*!< I/O port C clock enable */
#define  RCC_IOPDEN                      ((uint32_t)0x00000020)         /*!< I/O port D clock enable */
#define  RCC_ADC1EN                      ((uint32_t)0x00000200)         /*!< ADC 1 interface clock enable */

#define  RCC_ADC2EN                      ((uint32_t)0x00000400)         /*!< ADC 2 interface clock enable */


#define  RCC_TIM1EN                      ((uint32_t)0x00000800)         /*!< TIM1 Timer clock enable */
#define  RCC_SPI1EN                      ((uint32_t)0x00001000)         /*!< SPI 1 clock enable */
#define  RCC_USART1EN                    ((uint32_t)0x00004000)         /*!< USART1 clock enable */

/*****************  Bit definition for RCC_APB1PCENR register  ******************/
#define  RCC_TIM2EN                      ((uint32_t)0x00000001)        /*!< Timer 2 clock enabled*/
#define  RCC_TIM3EN                      ((uint32_t)0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_WWDGEN                      ((uint32_t)0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_USART2EN                    ((uint32_t)0x00020000)        /*!< USART 2 clock enable */
#define  RCC_I2C1EN                      ((uint32_t)0x00200000)        /*!< I2C 1 clock enable */

#define  RCC_BKPEN                       ((uint32_t)0x08000000)        /*!< Backup interface clock enable */
#define  RCC_PWREN                       ((uint32_t)0x10000000)        /*!< Power interface clock enable */


#define  RCC_USBEN                       ((uint32_t)0x00800000)        /*!< USB Device clock enable */

/*******************  Bit definition for RCC_BDCTLR register  *******************/
#define  RCC_LSEON                       ((uint32_t)0x00000001)        /*!< External Low Speed oscillator enable */
#define  RCC_LSERDY                      ((uint32_t)0x00000002)        /*!< External Low Speed oscillator Ready */
#define  RCC_LSEBYP                      ((uint32_t)0x00000004)        /*!< External Low Speed oscillator Bypass */

#define  RCC_RTCSEL                      ((uint32_t)0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_RTCSEL_0                    ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  RCC_RTCSEL_1                    ((uint32_t)0x00000200)        /*!< Bit 1 */

/*!< RTC congiguration */
#define  RCC_RTCSEL_NOCLOCK              ((uint32_t)0x00000000)        /*!< No clock */
#define  RCC_RTCSEL_LSE                  ((uint32_t)0x00000100)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_RTCSEL_LSI                  ((uint32_t)0x00000200)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_RTCSEL_HSE                  ((uint32_t)0x00000300)        /*!< HSE oscillator clock divided by 128 used as RTC clock */

#define  RCC_RTCEN                       ((uint32_t)0x00008000)        /*!< RTC clock enable */
#define  RCC_BDRST                       ((uint32_t)0x00010000)        /*!< Backup domain software reset  */

/*******************  Bit definition for RCC_RSTSCKR register  ********************/  
#define  RCC_LSION                       ((uint32_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_LSIRDY                      ((uint32_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_RMVF                        ((uint32_t)0x01000000)        /*!< Remove reset flag */
#define  RCC_PINRSTF                     ((uint32_t)0x04000000)        /*!< PIN reset flag */
#define  RCC_PORRSTF                     ((uint32_t)0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_SFTRSTF                     ((uint32_t)0x10000000)        /*!< Software Reset flag */
#define  RCC_IWDGRSTF                    ((uint32_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_WWDGRSTF                    ((uint32_t)0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_LPWRRSTF                    ((uint32_t)0x80000000)        /*!< Low-Power reset flag */

/******************************************************************************/
/*                                                                            */
/*                             Real-Time Clock                                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for RTC_CTLRH register  ********************/
#define  RTC_CTLRH_SECIE                     ((uint8_t)0x01)               /*!< Second Interrupt Enable */
#define  RTC_CTLRH_ALRIE                     ((uint8_t)0x02)               /*!< Alarm Interrupt Enable */
#define  RTC_CTLRH_OWIE                      ((uint8_t)0x04)               /*!< OverfloW Interrupt Enable */

/*******************  Bit definition for RTC_CTLRL register  ********************/
#define  RTC_CTLRL_SECF                      ((uint8_t)0x01)               /*!< Second Flag */
#define  RTC_CTLRL_ALRF                      ((uint8_t)0x02)               /*!< Alarm Flag */
#define  RTC_CTLRL_OWF                       ((uint8_t)0x04)               /*!< OverfloW Flag */
#define  RTC_CTLRL_RSF                       ((uint8_t)0x08)               /*!< Registers Synchronized Flag */
#define  RTC_CTLRL_CNF                       ((uint8_t)0x10)               /*!< Configuration Flag */
#define  RTC_CTLRL_RTOFF                     ((uint8_t)0x20)               /*!< RTC operation OFF */

